---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRailingPlacementOffset
source: html/640d6603-84a8-3148-b5a2-6479e8470926.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRailingPlacementOffset Property

"Offset from Path"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRailingPlacementOffset { get; }
```